#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_iam_role.iam_execution_role_mwaa: Refreshing state... [id=test_role]
aws_vpc.vpc: Refreshing state... [id=vpc-07bd89ee15cd6192b]
aws_eip.eip_nat[1]: Refreshing state... [id=eipalloc-029c4d482989b052e]
aws_eip.eip_nat[0]: Refreshing state... [id=eipalloc-099132ca06af16412]
aws_s3_bucket.airflow_s3: Refreshing state... [id=my-tf-test-bucket-airflow-v1-us-east-1]
aws_route_table.nat_route_table[1]: Refreshing state... [id=rtb-01793f92f9c271414]
aws_subnet.private[1]: Refreshing state... [id=subnet-075f16fd09af6b66a]
aws_subnet.private[0]: Refreshing state... [id=subnet-0d5721a0e5827306f]
aws_route_table.nat_route_table[0]: Refreshing state... [id=rtb-0aa3f012dc7146d49]
aws_internet_gateway.gw: Refreshing state... [id=igw-050bfecdebb6aa73b]
aws_security_group.main_mwaa: Refreshing state... [id=sg-0e1cfb8b318b0fe21]
aws_subnet.public[0]: Refreshing state... [id=subnet-02b7675a50a750b5f]
aws_subnet.public[1]: Refreshing state... [id=subnet-017900bbf8d571d02]
aws_s3_bucket_public_access_block.airflow_s3_public_access_block: Refreshing state... [id=my-tf-test-bucket-airflow-v1-us-east-1]
aws_s3_bucket_versioning.airflow_s3_versioning: Refreshing state... [id=my-tf-test-bucket-airflow-v1-us-east-1]
aws_s3_bucket_acl.airflow_s3_acl: Refreshing state... [id=my-tf-test-bucket-airflow-v1-us-east-1,private]
aws_route_table.public_subnet_route_table: Refreshing state... [id=rtb-0de47c972b9b500c9]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-03462bbab1c11a1ad]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-02b762ffb9a1610a9]
aws_route.internet_in: Refreshing state... [id=r-rtb-0de47c972b9b500c91080289494]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0234eb2c9f8f96ef0]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0749c7899c37d176a]
aws_nat_gateway.nat_gateway[1]: Refreshing state... [id=nat-0342a1458c765c638]
aws_nat_gateway.nat_gateway[0]: Refreshing state... [id=nat-0f71aa50fdf3d44c8]
aws_mwaa_environment.airflow: Refreshing state... [id=example]
aws_route.nat_route[0]: Refreshing state... [id=r-rtb-0aa3f012dc7146d491080289494]
aws_route.nat_route[1]: Refreshing state... [id=r-rtb-01793f92f9c2714141080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_user.name will be created
  + resource "aws_iam_user" "name" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "user"
      + path          = "/"
      + tags_all      = (known after apply)
      + unique_id     = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @ashishjullia, Action: `pull_request`*